RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/cmsis_drivers/fsl_spi_cmsis.c
static int32_t SPI10_DMAInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI10_PIN_INIT
    RTE_SPI10_PIN_INIT();
#endif
    return SPI_DMAInitialize(cb_event, &SPI10_DMADriverState);
}

static int32_t SPI10_DMAUninitialize(void)
{
#ifdef RTE_SPI10_PIN_DEINIT
    RTE_SPI10_PIN_DEINIT();
#endif
    return SPI_DMAUninitialize(&SPI10_DMADriverState);
}

static int32_t SPI10_DMAPowerControl(ARM_POWER_STATE state)
{
    return SPI_DMAPowerControl(state, &SPI10_DMADriverState);
}

static int32_t SPI10_DMASend(const void *data, uint32_t num)
{
    return SPI_DMASend(data, num, &SPI10_DMADriverState);
}

static int32_t SPI10_DMAReceive(void *data, uint32_t num)
{
    return SPI_DMAReceive(data, num, &SPI10_DMADriverState);
}

static int32_t SPI10_DMATransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_DMATransfer(data_out, data_in, num, &SPI10_DMADriverState);
}

static uint32_t SPI10_DMAGetCount(void)
{
    return SPI_DMAGetCount(&SPI10_DMADriverState);
}

static int32_t SPI10_DMAControl(uint32_t control, uint32_t arg)
{
    return SPI_DMAControl(control, arg, &SPI10_DMADriverState);
}

static ARM_SPI_STATUS SPI10_DMAGetStatus(void)
{
    return SPI_DMAGetStatus(&SPI10_DMADriverState);
}

#endif

#else

static cmsis_spi_handle_t SPI10_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi10_interrupt_driver_state")
static cmsis_spi_interrupt_driver_state_t SPI10_InterruptDriverState = {
#else
static cmsis_spi_interrupt_driver_state_t SPI10_InterruptDriverState = {
#endif
    &SPI10_Resource,
    &SPI10_Handle,
};

static int32_t SPI10_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI10_PIN_INIT
    RTE_SPI10_PIN_INIT();
#endif
    return SPI_InterruptInitialize(cb_event, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptUninitialize(void)
{
#ifdef RTE_SPI10_PIN_DEINIT
    RTE_SPI10_PIN_DEINIT();
#endif
    return SPI_InterruptUninitialize(&SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptPowerControl(ARM_POWER_STATE state)
{
    return SPI_InterruptPowerControl(state, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptSend(const void *data, uint32_t num)
{
    return SPI_InterruptSend(data, num, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI10_InterruptDriverState);
}

static uint32_t SPI10_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI10_InterruptDriverState);
}

static ARM_SPI_STATUS SPI10_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI10_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI10 = {SPIx_GetVersion,     SPIx_GetCapabilities,
#if defined(RTE_SPI10_DMA_EN) && RTE_SPI10_DMA_EN
                               SPI10_DMAInitialize, SPI10_DMAUninitialize, SPI10_DMAPowerControl, SPI10_DMASend,
                               SPI10_DMAReceive,    SPI10_DMATransfer,     SPI10_DMAGetCount,     SPI10_DMAControl,
                               SPI10_DMAGetStatus
#else
                               SPI10_InterruptInitialize,
                               SPI10_InterruptUninitialize,
                               SPI10_InterruptPowerControl,
                               SPI10_InterruptSend,
                               SPI10_InterruptReceive,
                               SPI10_InterruptTransfer,
                               SPI10_InterruptGetCount,
                               SPI10_InterruptControl,
                               SPI10_InterruptGetStatus
#endif
};

#endif /*  SPI10  */

#if defined(SPI11) && defined(RTE_SPI11) && RTE_SPI11
/* User needs to provide the implementation for SPI11_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t SPI11_GetFreq(void);
static cmsis_spi_resource_t SPI11_Resource = {SPI11, 1, SPI11_GetFreq};

#if defined(RTE_SPI11_DMA_EN) && RTE_SPI11_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_spi_dma_resource_t SPI11_DMAResource = {RTE_SPI11_DMA_TX_DMA_BASE, RTE_SPI11_DMA_TX_CH,
                                                     RTE_SPI11_DMA_RX_DMA_BASE, RTE_SPI11_DMA_RX_CH};

static cmsis_spi_dma_handle_t SPI11_DmaHandle;
static dma_handle_t SPI11_DmaTxDataHandle;
static dma_handle_t SPI11_DmaRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi11_dma_driver_state")
static cmsis_spi_dma_driver_state_t SPI11_DMADriverState = {
#else
static cmsis_spi_dma_driver_state_t SPI11_DMADriverState = {
#endif
    &SPI11_Resource, &SPI11_DMAResource, &SPI11_DmaHandle, &SPI11_DmaRxDataHandle, &SPI11_DmaTxDataHandle,
};

static int32_t SPI11_DMAInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI11_PIN_INIT
    RTE_SPI11_PIN_INIT();
#endif
    return SPI_DMAInitialize(cb_event, &SPI11_DMADriverState);
}

static int32_t SPI11_DMAUninitialize(void)
{
#ifdef RTE_SPI11_PIN_DEINIT
    RTE_SPI11_PIN_DEINIT();
#endif
    return SPI_DMAUninitialize(&SPI11_DMADriverState);
}

static int32_t SPI11_DMAPowerControl(ARM_POWER_STATE state)
{
    return SPI_DMAPowerControl(state, &SPI11_DMADriverState);
}

static int32_t SPI11_DMASend(const void *data, uint32_t num)
{
    return SPI_DMASend(data, num, &SPI11_DMADriverState);
}

static int32_t SPI11_DMAReceive(void *data, uint32_t num)
{
    return SPI_DMAReceive(data, num, &SPI11_DMADriverState);
}

static int32_t SPI11_DMATransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_DMATransfer(data_out, data_in, num, &SPI11_DMADriverState);
}

static uint32_t SPI11_DMAGetCount(void)
{
    return SPI_DMAGetCount(&SPI11_DMADriverState);
}

static int32_t SPI11_DMAControl(uint32_t control, uint32_t arg)
{
    return SPI_DMAControl(control, arg, &SPI11_DMADriverState);
}

