RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/LPC55S6X/cmsis_drivers/fsl_spi_cmsis.c
static int32_t SPI12_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI12_InterruptDriverState);
}

static uint32_t SPI12_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI12_InterruptDriverState);
}

static ARM_SPI_STATUS SPI12_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI12_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI12 = {SPIx_GetVersion,     SPIx_GetCapabilities,
#if defined(RTE_SPI12_DMA_EN) && RTE_SPI12_DMA_EN
                               SPI12_DMAInitialize, SPI12_DMAUninitialize, SPI12_DMAPowerControl, SPI12_DMASend,
                               SPI12_DMAReceive,    SPI12_DMATransfer,     SPI12_DMAGetCount,     SPI12_DMAControl,
                               SPI12_DMAGetStatus
#else
                               SPI12_InterruptInitialize,
                               SPI12_InterruptUninitialize,
                               SPI12_InterruptPowerControl,
                               SPI12_InterruptSend,
                               SPI12_InterruptReceive,
                               SPI12_InterruptTransfer,
                               SPI12_InterruptGetCount,
                               SPI12_InterruptControl,
                               SPI12_InterruptGetStatus
#endif
};

#endif /*  SPI12  */

#if defined(SPI13) && defined(RTE_SPI13) && RTE_SPI13
/* User needs to provide the implementation for SPI13_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t SPI13_GetFreq(void);
static cmsis_spi_resource_t SPI13_Resource = {SPI13, 1, SPI13_GetFreq};

#if defined(RTE_SPI13_DMA_EN) && RTE_SPI13_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_spi_dma_resource_t SPI13_DMAResource = {RTE_SPI13_DMA_TX_DMA_BASE, RTE_SPI13_DMA_TX_CH,
                                                     RTE_SPI13_DMA_RX_DMA_BASE, RTE_SPI13_DMA_RX_CH};

static cmsis_spi_dma_handle_t SPI13_DmaHandle;
static dma_handle_t SPI13_DmaTxDataHandle;
static dma_handle_t SPI13_DmaRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi13_dma_driver_state")
static cmsis_spi_dma_driver_state_t SPI13_DMADriverState = {
#else
static cmsis_spi_dma_driver_state_t SPI13_DMADriverState = {
#endif
    &SPI13_Resource, &SPI13_DMAResource, &SPI13_DmaHandle, &SPI13_DmaRxDataHandle, &SPI13_DmaTxDataHandle,
};

static int32_t SPI13_DMAInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI13_PIN_INIT
    RTE_SPI13_PIN_INIT();
#endif
    return SPI_DMAInitialize(cb_event, &SPI13_DMADriverState);
}

static int32_t SPI13_DMAUninitialize(void)
{
#ifdef RTE_SPI13_PIN_DEINIT
    RTE_SPI13_PIN_DEINIT();
#endif
    return SPI_DMAUninitialize(&SPI13_DMADriverState);
}

static int32_t SPI13_DMAPowerControl(ARM_POWER_STATE state)
{
    return SPI_DMAPowerControl(state, &SPI13_DMADriverState);
}

static int32_t SPI13_DMASend(const void *data, uint32_t num)
{
    return SPI_DMASend(data, num, &SPI13_DMADriverState);
}

static int32_t SPI13_DMAReceive(void *data, uint32_t num)
{
    return SPI_DMAReceive(data, num, &SPI13_DMADriverState);
}

static int32_t SPI13_DMATransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_DMATransfer(data_out, data_in, num, &SPI13_DMADriverState);
}

static uint32_t SPI13_DMAGetCount(void)
{
    return SPI_DMAGetCount(&SPI13_DMADriverState);
}

static int32_t SPI13_DMAControl(uint32_t control, uint32_t arg)
{
    return SPI_DMAControl(control, arg, &SPI13_DMADriverState);
}

static ARM_SPI_STATUS SPI13_DMAGetStatus(void)
{
    return SPI_DMAGetStatus(&SPI13_DMADriverState);
}

#endif

#else

static cmsis_spi_handle_t SPI13_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi13_interrupt_driver_state")
static cmsis_spi_interrupt_driver_state_t SPI13_InterruptDriverState = {
#else
static cmsis_spi_interrupt_driver_state_t SPI13_InterruptDriverState = {
#endif
    &SPI13_Resource,
    &SPI13_Handle,
};

static int32_t SPI13_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI13_PIN_INIT
    RTE_SPI13_PIN_INIT();
#endif
    return SPI_InterruptInitialize(cb_event, &SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptUninitialize(void)
{
#ifdef RTE_SPI13_PIN_DEINIT
    RTE_SPI13_PIN_DEINIT();
#endif
    return SPI_InterruptUninitialize(&SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptPowerControl(ARM_POWER_STATE state)
{
    return SPI_InterruptPowerControl(state, &SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptSend(const void *data, uint32_t num)
{
    return SPI_InterruptSend(data, num, &SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI13_InterruptDriverState);
}

static uint32_t SPI13_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI13_InterruptDriverState);
}

static ARM_SPI_STATUS SPI13_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI13_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI13 = {SPIx_GetVersion,     SPIx_GetCapabilities,
#if defined(RTE_SPI13_DMA_EN) && RTE_SPI13_DMA_EN
                               SPI13_DMAInitialize, SPI13_DMAUninitialize, SPI13_DMAPowerControl, SPI13_DMASend,
                               SPI13_DMAReceive,    SPI13_DMATransfer,     SPI13_DMAGetCount,     SPI13_DMAControl,
                               SPI13_DMAGetStatus
#else
                               SPI13_InterruptInitialize,
                               SPI13_InterruptUninitialize,
                               SPI13_InterruptPowerControl,
                               SPI13_InterruptSend,
                               SPI13_InterruptReceive,
                               SPI13_InterruptTransfer,
                               SPI13_InterruptGetCount,
                               SPI13_InterruptControl,
                               SPI13_InterruptGetStatus
#endif
};

#endif /*  SPI13  */
